posts/october-goal-conclusion.org
#+title: October Challenges Conclusion
#+date: <2022-10-31 22:16> 
#+filetags: reading books skateboarding writing orthodox art music exercise gaming

It's October 31 and what a month it has been! Today, as my last writing exercise of the month, I'm writing the conclusion to my [[https://mjgpy3.github.io/me/overly-ambitious-october-challenges.html][Overly Ambitious October Challenge]] series.

These challenges have certainly been enriching. As I mentioned in my [[https://mjgpy3.github.io/me/october-goal-update-1.html][earlier update]], these have been difficult to maintain, but they've been nonetheless rewarding. So let's review where I landed with each one.

* Challenges
** Inktober (AKA Drawtober)
   
_Score: 31/31, 100%!_

I completed my first Inktober! This was a lot more fun than I expected. I plan on writing a separate post with a scan of each drawing.

I may continue this challenge in a different form. Trying to draw a random Wikipedia article each day could be an interesting exercise.
   
** Skateober
   
_Score: 31/31, 100%!_

I managed to land, record, and publish, a trick for each day of the month. Due to weather and time constraints, as expected, I did many of these tricks in the same few sessions. I believe it took four sessions in all to complete the tricks.

All the tricks are in this [[https://www.youtube.com/playlist?list=PL97kkzI__pGzvRuON8V_JSRg2VgGON7jc][YouTube playlist]].

** Booktober
   
_Score: 4/4, 100% (plus some extra)!_

This month I read, in entirety
 - /Making Comics/
 - /As a Man Thinketh/
 - /I, Robot/, and
 - /The Storm Before the Storm/

Though I didn't fully complete a fifth book, I also read
 - 1/3 of /The Brothers Karamazov/ (quite a feat in itself)
 - Some /Charlie and the Chocolate Factory/ aloud to my family
 - 2/3 of /The 7 Habits of Highly Effective People/
 - 1/2 of /The Story of My Life/ (Helen Keller's autobiography)
 - a little bit of /The Two Towers/ (which I've been reading aloud for some time now)

This goal was wonderful and I hope to continue the pace of reading about a book a week. Of course, engaging with longer books may make this challenging.

** Photober
   
_Score: 31/31, 100%!_

I managed to take a unique photograph every day. Figuring out what to photograph (e.g. capturing "the right moment") was far more challenging than I expected. I plan on publishing the photos in a separate post.

I will not be continuing this challenge but will continue to take ad hoc photos.

** Psalmtober
   
_Score: 151/151, 100%!_

I finished this challenge a few days early. This challenge sort of speaks for itself. I've always found reading the Psalms to be a beneficial activity. Reading through them all was certainly edifying.

** Sober October

_Score: 31/31, 100%!_

I managed to avoid alcohol for the entire month! This was good because it definitely helped (1) improve my quality of sleep, and, thereby, (2) made me more successful in other challenges. This was really only difficult when I was at events where alcohol was served.
   
** Hasktober

_Score: 31/31, 100%!_

Completion of this challenge was primarily accomplished through the reading of Haskell articles. I did also listen to some podcasts.

I did write a little bit of code in my private, Dominion (card game) tracking repository. I also wrote some code to play with the evaluator in "Why Calculating is better than scheming".

The articles/papers/code I read where
 - Haskell in Production: NoRedInk
 - [[https://blog.drewolson.org/easy-json][Easy JSON in Haskell]]
 - [[https://www.haskellforall.com/2022/05/generate-web-forms-from-pure-functions.html][Generate web forms from pure functions]]
 - [[https://www.cs.kent.ac.uk/people/staff/dat/miranda/wadler87.pdf][Why calculating is better than scheming]]
 - [[https://jesper.sikanda.be/posts/agda2hs.html][Don't worry, be happy]]
 - [[https://yairchu.github.io/posts/reduce-sharing-in-haskell][3 Ways To Reduce Sharing In Haskell]]
 - [[https://www.parsonsmatt.org/2016/06/24/take_over_an_api_with_servant.html][Incremental API Takeover With Servant]]
 - [[https://neilmitchell.blogspot.com/2016/08/the-four-flaws-of-haskell.html][The Four Flaws Of Haskell]]
 - [[https://www.fpcomplete.com/blog/2016/08/bitrot-free-scripts/][Practical Haskell: Bitrot-free Scripts]]
 - [[http://blog.ezyang.com/2016/07/what-template-haskell-gets-wrong-and-racket-gets-right/][What Template Haskell gets wrong and Racket gets right]]
 - [[https://www.nmattia.com/posts/2016-08-19-lens-linear-2048.html][Lens and Linear, 2048's logic in 22 lines]]
 - [[https://www.tweag.io/blog/2016-10-17-inline-java/][A New Ecosystem for Haskell: The JVM]]
 - [[https://yairchu.github.io/posts/codecs-as-prisms.html][Parsers And Builders As Prisms]]
 - [[https://www.schoolofhaskell.com/school/to-infinity-and-beyond/pick-of-the-week/a-little-lens-starter-tutorial][A Little Lens Starter Tutorial]]
 - [[https://www.joachim-breitner.de/blog/796-rec-def__Minesweeper_case_study][rec-def: Minesweeper case study]]
 - [[https://blog.ocharles.org.uk/posts/2022-06-22-list-of-monoids-pattern.html][List of monoids pattern]]
 - [[https://bor0.wordpress.com/2021/06/07/re-inventing-the-monad-wheel/][Re-inventing the Monad wheel]]
 - Why no one uses functional languages
 - [[https://blog.plover.com/prog/haskell/lazy-search.html][Tree search in Haskell]]
 - [[https://doisinkidney.com/posts/2022-10-17-lazy-group-on.html][Lazy Grouping in Haskell]]
 - [[https://diagrams.github.io/doc/quickstart.html][Diagrams Tutorial]] (read and worked through it)
 - ChessIO source code

The podcasts I listened to were
 - [[https://haskellweekly.news/episode/36.html][Production Haskell with Matt Parsons]]
 - Haskell weekly #56
 - [[https://haskellweekly.news/episode/57.html][Haskell Weekly #57]]
 - [[https://haskellweekly.news/episode/52.html][Haskell Weekly #52]]
 - [[https://www.haskellcast.com/episode/001-edward-kmett-on-lenses][Haskellcast #1 with Kmett]]
 - [[https://haskellweekly.news/episode/29.html][Haskell Weekly #29]]
 - [[https://haskellweekly.news/episode/13.html][Haskell Weekly #13]]

