docs/october-goal-conclusion.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>October Challenges Conclusion</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">31 Oct 2022</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/october-goal-conclusion.html">October Challenges Conclusion</a></h1>
<p>
It's October 31 and what a month it has been! Today, as my last writing exercise of the month, I'm writing the conclusion to my <a href="https://mjgpy3.github.io/me/overly-ambitious-october-challenges.html">Overly Ambitious October Challenge</a> series.
</p>

<p>
These challenges have certainly been enriching. As I mentioned in my <a href="https://mjgpy3.github.io/me/october-goal-update-1.html">earlier update</a>, these have been difficult to maintain, but they've been nonetheless rewarding. So let's review where I landed with each one.
</p>

<div id="outline-container-orge33e397" class="outline-2">
<h2 id="orge33e397">Challenges</h2>
<div class="outline-text-2" id="text-orge33e397">
</div>
<div id="outline-container-orge552f55" class="outline-3">
<h3 id="orge552f55">Inktober (AKA Drawtober)</h3>
<div class="outline-text-3" id="text-orge552f55">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I completed my first Inktober! This was a lot more fun than I expected. I plan on writing a separate post with a scan of each drawing.
</p>

<p>
I may continue this challenge in a different form. Trying to draw a random Wikipedia article each day could be an interesting exercise.
</p>
</div>
</div>

<div id="outline-container-org39f2598" class="outline-3">
<h3 id="org39f2598">Skateober</h3>
<div class="outline-text-3" id="text-org39f2598">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I managed to land, record, and publish, a trick for each day of the month. Due to weather and time constraints, as expected, I did many of these tricks in the same few sessions. I believe it took four sessions in all to complete the tricks.
</p>

<p>
All the tricks are in this <a href="https://www.youtube.com/playlist?list=PL97kkzI__pGzvRuON8V_JSRg2VgGON7jc">YouTube playlist</a>.
</p>
</div>
</div>

<div id="outline-container-orga92841b" class="outline-3">
<h3 id="orga92841b">Booktober</h3>
<div class="outline-text-3" id="text-orga92841b">
<p>
<span class="underline">Score: 4/4, 100% (plus some extra)!</span>
</p>

<p>
This month I read, in entirety
</p>
<ul class="org-ul">
<li><i>Making Comics</i></li>
<li><i>As a Man Thinketh</i></li>
<li><i>I, Robot</i>, and</li>
<li><i>The Storm Before the Storm</i></li>
</ul>

<p>
Though I didn't fully complete a fifth book, I also read
</p>
<ul class="org-ul">
<li>1/3 of <i>The Brothers Karamazov</i> (quite a feat in itself)</li>
<li>Some <i>Charlie and the Chocolate Factory</i> aloud to my family</li>
<li>2/3 of <i>The 7 Habits of Highly Effective People</i></li>
<li>1/2 of <i>The Story of My Life</i> (Helen Keller's autobiography)</li>
<li>a little bit of <i>The Two Towers</i> (which I've been reading aloud for some time now)</li>
</ul>

<p>
This goal was wonderful and I hope to continue the pace of reading about a book a week. Of course, engaging with longer books may make this challenging.
</p>
</div>
</div>

<div id="outline-container-orgc67f5ae" class="outline-3">
<h3 id="orgc67f5ae">Photober</h3>
<div class="outline-text-3" id="text-orgc67f5ae">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I managed to take a unique photograph every day. Figuring out what to photograph (e.g. capturing "the right moment") was far more challenging than I expected. I plan on publishing the photos in a separate post.
</p>

<p>
I will not be continuing this challenge but will continue to take ad hoc photos.
</p>
</div>
</div>

<div id="outline-container-org9ead7f7" class="outline-3">
<h3 id="org9ead7f7">Psalmtober</h3>
<div class="outline-text-3" id="text-org9ead7f7">
<p>
<span class="underline">Score: 151/151, 100%!</span>
</p>

<p>
I finished this challenge a few days early. This challenge sort of speaks for itself. I've always found reading the Psalms to be a beneficial activity. Reading through them all was certainly edifying.
</p>
</div>
</div>

<div id="outline-container-org87f7a9b" class="outline-3">
<h3 id="org87f7a9b">Sober October</h3>
<div class="outline-text-3" id="text-org87f7a9b">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I managed to avoid alcohol for the entire month! This was good because it definitely helped (1) improve my quality of sleep, and, thereby, (2) made me more successful in other challenges. This was really only difficult when I was at events where alcohol was served.
</p>
</div>
</div>

<div id="outline-container-org58d9541" class="outline-3">
<h3 id="org58d9541">Hasktober</h3>
<div class="outline-text-3" id="text-org58d9541">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
Completion of this challenge was primarily accomplished through the reading of Haskell articles. I did also listen to some podcasts.
</p>

<p>
I did write a little bit of code in my private, Dominion (card game) tracking repository. I also wrote some code to play with the evaluator in "Why Calculating is better than scheming".
</p>

<p>
The articles/papers/code I read where
</p>
<ul class="org-ul">
<li>Haskell in Production: NoRedInk</li>
<li><a href="https://blog.drewolson.org/easy-json">Easy JSON in Haskell</a></li>
<li><a href="https://www.haskellforall.com/2022/05/generate-web-forms-from-pure-functions.html">Generate web forms from pure functions</a></li>
<li><a href="https://www.cs.kent.ac.uk/people/staff/dat/miranda/wadler87.pdf">Why calculating is better than scheming</a></li>
<li><a href="https://jesper.sikanda.be/posts/agda2hs.html">Don't worry, be happy</a></li>
<li><a href="https://yairchu.github.io/posts/reduce-sharing-in-haskell">3 Ways To Reduce Sharing In Haskell</a></li>
<li><a href="https://www.parsonsmatt.org/2016/06/24/take_over_an_api_with_servant.html">Incremental API Takeover With Servant</a></li>
<li><a href="https://neilmitchell.blogspot.com/2016/08/the-four-flaws-of-haskell.html">The Four Flaws Of Haskell</a></li>
<li><a href="https://www.fpcomplete.com/blog/2016/08/bitrot-free-scripts/">Practical Haskell: Bitrot-free Scripts</a></li>
<li><a href="http://blog.ezyang.com/2016/07/what-template-haskell-gets-wrong-and-racket-gets-right/">What Template Haskell gets wrong and Racket gets right</a></li>
<li><a href="https://www.nmattia.com/posts/2016-08-19-lens-linear-2048.html">Lens and Linear, 2048's logic in 22 lines</a></li>
<li><a href="https://www.tweag.io/blog/2016-10-17-inline-java/">A New Ecosystem for Haskell: The JVM</a></li>
<li><a href="https://yairchu.github.io/posts/codecs-as-prisms.html">Parsers And Builders As Prisms</a></li>
<li><a href="https://www.schoolofhaskell.com/school/to-infinity-and-beyond/pick-of-the-week/a-little-lens-starter-tutorial">A Little Lens Starter Tutorial</a></li>
<li><a href="https://www.joachim-breitner.de/blog/796-rec-def__Minesweeper_case_study">rec-def: Minesweeper case study</a></li>
<li><a href="https://blog.ocharles.org.uk/posts/2022-06-22-list-of-monoids-pattern.html">List of monoids pattern</a></li>
<li><a href="https://bor0.wordpress.com/2021/06/07/re-inventing-the-monad-wheel/">Re-inventing the Monad wheel</a></li>
<li>Why no one uses functional languages</li>
<li><a href="https://blog.plover.com/prog/haskell/lazy-search.html">Tree search in Haskell</a></li>
<li><a href="https://doisinkidney.com/posts/2022-10-17-lazy-group-on.html">Lazy Grouping in Haskell</a></li>
<li><a href="https://diagrams.github.io/doc/quickstart.html">Diagrams Tutorial</a> (read and worked through it)</li>
<li>ChessIO source code</li>
</ul>

<p>
The podcasts I listened to were
</p>
<ul class="org-ul">
<li><a href="https://haskellweekly.news/episode/36.html">Production Haskell with Matt Parsons</a></li>
<li>Haskell weekly #56</li>
<li><a href="https://haskellweekly.news/episode/57.html">Haskell Weekly #57</a></li>
<li><a href="https://haskellweekly.news/episode/52.html">Haskell Weekly #52</a></li>
<li><a href="https://www.haskellcast.com/episode/001-edward-kmett-on-lenses">Haskellcast #1 with Kmett</a></li>
<li><a href="https://haskellweekly.news/episode/29.html">Haskell Weekly #29</a></li>
<li><a href="https://haskellweekly.news/episode/13.html">Haskell Weekly #13</a></li>
</ul>
</div>
</div>
