posts/october-goal-conclusion.org
** Writober
   
_Score: 31/31, 100%!_

This challenge was good but I don't plan on continuing it. Writing is fun and I certainly need to practice it more. Daily writing goals just didn't really do it for me though. I don't feel like I gained a lot and mostly just sped through my writing activities.

I ended up writing
 - 3 updates on my October challenges
 - 11 book reviews
 - 1 letter, and
 - 16 private journal entries
   
** YouTober

_Score: 35/31, 113%!_

I ended up hacking this challenge by being sure to publish each skateboarding trick that I did. I also published a few more random videos giving me some extra credit!

** Langtober

_Score: 31/31, 100%!_
   
This ended up being very easy to accomplish. A DuoLingo lesson (or more) a day is pretty easy to fit around other activities. Though I mostly finished them first thing in the morning.
   
** Musictober

_Score: 930 minutes/930 minutes, 100%!_

I finished this challenge 5 days ago. This was a real blast and gave me the opportunity to memorize some songs on my mandolin.

Only about an hour of this ended up being guitar practice. The rest was all mandolin!

** Curiousitober
   
_Score: 31/31, 100%!_

This challenge was a ton of fun and I believe I've learned a few things.

Here are the questions I asked each day
 - Is there a deeper meaning of /Blood Meridian/?
 - How did chess come about and develop?
 - Why do we say "turn over a new leaf"?
 - Who is "Katari" in Brendan's Death Song?
 - What is the difference between a crocodile and an alligator?
 - Where does ALDI USA's food come from?
 - Why do some classics have names/places blanked out?
 - What is second person and does anything use it?
 - How did people greet each other before "hello"?
 - When is the best time to eat protein (relative to exercise)?
 - What is the Talmud and where did it come from?
 - Were stink bugs imported?
 - Why do we say "remember to wash behind your ears"?
 - Why do LP and EP seem to be reversed? (I thought that "L" was for "limited" but it's "long")
 - How to win more at solitaire?
 - How is the rouble related to the kopeck?
 - What are some popular games playable with normal dice?
 - What is the oldest board games still played today?
 - Is Cormack McCarthy still alive and writing?
 - When do you say good morning vs afternoon vs etc...?
 - Why is the skate grind called a 5-0?
 - What's the backstory of Lego?
 - What is the relationship between Romania and Rome?
 - What is the modern history of Alaska?
 - Nuclear fission vs fusion?
 - Why do some wooden spoons have a hole through them?
 - How are books modernly printed?
 - When were crossbows invented?
 - How many people died from the Spanish Flu?
 - How high was the highest bomb drop in?
 - What is the history of St. Basil's Cathedral?
 
** Exertober
   
_Score: 26/26, 100%!_

This was a good challenge though it was one of the most difficult to keep up. I tended to overdo it on certain days making consecutive days more difficult. This ended up being a pretty even split of (1) body weight training, (2) intense skateboarding sessions, and (3) using a body weight exercise dice.

I will certainly keep up the body weight training but will not do as many days consecutively in the future.

** Unplugtober

_Score: 30/31, 97%_

This was extremely good for me. Like "Sober October" this kept me focused and helped with sleep. I did have one day where I wandered off into internet scrolling and wasted some time. But every other day was successful by my original rubric.

I would really like to keep this up.
   
** Walktober

_Score: 31/31, 100%!_

This was a fun one. Going on a walk every day proved to be too challenging with weather and other business. However, some days I doubled up. I also counted certain very long walks (e.g. spending the day at the zoo) as two. It's always nice to get some fresh air.
  
** Voictober
   
_Score: 1/1, 100% (plus some extra)!_

I read /I, Robot/ aloud to accomplish this goal. I also read more than half of /As a Man Thinketh/ aloud and some of /The Two Towers/.
   
** Cooktober

_Score: 36/31, 116!%_

This was largely accomplished by the fact that I cooked breakfast for my family almost every day in the month. Other meals/foods included lots of grilling, making blini, pumpkin puree, roasted pumpkin seeds, and a good bit of custard.
   
** Thriftober

_Score: $5 out of max of $31, 100%!_

I bought a few books at a book sale early on in the month but that was it! No other "unnecessary spending".
   
** Churchtober

_Score: 13/15, 87%_

I had to miss two services due to other family events, however, I managed to make it to every other service! This was a great way to spend some time this month.
   
** Whittletober

_Score: 31/31, 100%!_

I ended up whittling a chess piece each day. This was a great way to stay motivated and avoid the "what will I whittle next?" question. So at this point I have 31 rough chess pieces. I plan on whittling the final king later this week.

Of course, these pieces are all rough and in need of sanding and finishing.
   
** Optober

_Score: ???_

I think I'm throwing this challenge out. It's just too hard to call for me and too fuzzy. I feel like I did pretty good at it. However, I also feel like I totally failed it. As always, man is the worst just of himself.
   
** Brotober
   
_Score: 22/31, 72%_

Due to some unforeseen circumstances, I was not able to hang out with my brother every day this month. It was still great time spent when we did hang out.

** Gametober
   
_Score: 31/31, 100%_

This was a ton of fun. The games I played were
 - Chess
 - Foosball
 - Pentago
 - Rummikub
 - 40K mission 1
 - Zombie Dice
 - Go fish
 - Jenga
 - Solitaire
 - Pandemic: The Cure
 - Carcassone
 - Pandemic
 - 40K mission 2
 - Connect 4
 - Carcassone w/ River Exp.
 - Blokus
 - Oregon Trail The Card Game
 - Ship-Captain-Crew
 - Midnight
 - Blokus Duo
 - Dominion: Huge Collections
 - Dominion: Forest Scouts
 - Word Yahtzee
 - Billards
 - I Can Do That!
 - What The Fish
 - Carcassone w/ Abbott Exp.
 - Magic The Gathering
 - Sudoku
 - Dominion: Decisions, Decisions
 - 40K mission 3
   
