docs/october-goal-conclusion.html

<div id="outline-container-org40105fe" class="outline-3">
<h3 id="org40105fe">Writober</h3>
<div class="outline-text-3" id="text-org40105fe">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
This challenge was good but I don't plan on continuing it. Writing is fun and I certainly need to practice it more. Daily writing goals just didn't really do it for me though. I don't feel like I gained a lot and mostly just sped through my writing activities.
</p>

<p>
I ended up writing
</p>
<ul class="org-ul">
<li>3 updates on my October challenges</li>
<li>11 book reviews</li>
<li>1 letter, and</li>
<li>16 private journal entries</li>
</ul>
</div>
</div>

<div id="outline-container-org5775a45" class="outline-3">
<h3 id="org5775a45">YouTober</h3>
<div class="outline-text-3" id="text-org5775a45">
<p>
<span class="underline">Score: 35/31, 113%!</span>
</p>

<p>
I ended up hacking this challenge by being sure to publish each skateboarding trick that I did. I also published a few more random videos giving me some extra credit!
</p>
</div>
</div>

<div id="outline-container-orgbe1ab95" class="outline-3">
<h3 id="orgbe1ab95">Langtober</h3>
<div class="outline-text-3" id="text-orgbe1ab95">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
This ended up being very easy to accomplish. A DuoLingo lesson (or more) a day is pretty easy to fit around other activities. Though I mostly finished them first thing in the morning.
</p>
</div>
</div>

<div id="outline-container-org30263e2" class="outline-3">
<h3 id="org30263e2">Musictober</h3>
<div class="outline-text-3" id="text-org30263e2">
<p>
<span class="underline">Score: 930 minutes/930 minutes, 100%!</span>
</p>

<p>
I finished this challenge 5 days ago. This was a real blast and gave me the opportunity to memorize some songs on my mandolin.
</p>

<p>
Only about an hour of this ended up being guitar practice. The rest was all mandolin!
</p>
</div>
</div>

<div id="outline-container-org92ab4c8" class="outline-3">
<h3 id="org92ab4c8">Curiousitober</h3>
<div class="outline-text-3" id="text-org92ab4c8">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
This challenge was a ton of fun and I believe I've learned a few things.
</p>

<p>
Here are the questions I asked each day
</p>
<ul class="org-ul">
<li>Is there a deeper meaning of <i>Blood Meridian</i>?</li>
<li>How did chess come about and develop?</li>
<li>Why do we say "turn over a new leaf"?</li>
<li>Who is "Katari" in Brendan's Death Song?</li>
<li>What is the difference between a crocodile and an alligator?</li>
<li>Where does ALDI USA's food come from?</li>
<li>Why do some classics have names/places blanked out?</li>
<li>What is second person and does anything use it?</li>
<li>How did people greet each other before "hello"?</li>
<li>When is the best time to eat protein (relative to exercise)?</li>
<li>What is the Talmud and where did it come from?</li>
<li>Were stink bugs imported?</li>
<li>Why do we say "remember to wash behind your ears"?</li>
<li>Why do LP and EP seem to be reversed? (I thought that "L" was for "limited" but it's "long")</li>
<li>How to win more at solitaire?</li>
<li>How is the rouble related to the kopeck?</li>
<li>What are some popular games playable with normal dice?</li>
<li>What is the oldest board games still played today?</li>
<li>Is Cormack McCarthy still alive and writing?</li>
<li>When do you say good morning vs afternoon vs etc&#x2026;?</li>
<li>Why is the skate grind called a 5-0?</li>
<li>What's the backstory of Lego?</li>
<li>What is the relationship between Romania and Rome?</li>
<li>What is the modern history of Alaska?</li>
<li>Nuclear fission vs fusion?</li>
<li>Why do some wooden spoons have a hole through them?</li>
<li>How are books modernly printed?</li>
<li>When were crossbows invented?</li>
<li>How many people died from the Spanish Flu?</li>
<li>How high was the highest bomb drop in?</li>
<li>What is the history of St. Basil's Cathedral?</li>
</ul>
</div>
</div>

<div id="outline-container-org7d17e92" class="outline-3">
<h3 id="org7d17e92">Exertober</h3>
<div class="outline-text-3" id="text-org7d17e92">
<p>
<span class="underline">Score: 26/26, 100%!</span>
</p>

<p>
This was a good challenge though it was one of the most difficult to keep up. I tended to overdo it on certain days making consecutive days more difficult. This ended up being a pretty even split of (1) body weight training, (2) intense skateboarding sessions, and (3) using a body weight exercise dice.
</p>

<p>
I will certainly keep up the body weight training but will not do as many days consecutively in the future.
</p>
</div>
</div>

<div id="outline-container-orgb28a1aa" class="outline-3">
<h3 id="orgb28a1aa">Unplugtober</h3>
<div class="outline-text-3" id="text-orgb28a1aa">
<p>
<span class="underline">Score: 30/31, 97%</span>
</p>

<p>
This was extremely good for me. Like "Sober October" this kept me focused and helped with sleep. I did have one day where I wandered off into internet scrolling and wasted some time. But every other day was successful by my original rubric.
</p>

<p>
I would really like to keep this up.
</p>
</div>
</div>

<div id="outline-container-orgdd74a2c" class="outline-3">
<h3 id="orgdd74a2c">Walktober</h3>
<div class="outline-text-3" id="text-orgdd74a2c">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
This was a fun one. Going on a walk every day proved to be too challenging with weather and other business. However, some days I doubled up. I also counted certain very long walks (e.g. spending the day at the zoo) as two. It's always nice to get some fresh air.
</p>
</div>
</div>

<div id="outline-container-org92a78cf" class="outline-3">
<h3 id="org92a78cf">Voictober</h3>
<div class="outline-text-3" id="text-org92a78cf">
<p>
<span class="underline">Score: 1/1, 100% (plus some extra)!</span>
</p>

<p>
I read <i>I, Robot</i> aloud to accomplish this goal. I also read more than half of <i>As a Man Thinketh</i> aloud and some of <i>The Two Towers</i>.
</p>
</div>
</div>

<div id="outline-container-orgf38add1" class="outline-3">
<h3 id="orgf38add1">Cooktober</h3>
<div class="outline-text-3" id="text-orgf38add1">
<p>
<span class="underline">Score: 36/31, 116!%</span>
</p>

<p>
This was largely accomplished by the fact that I cooked breakfast for my family almost every day in the month. Other meals/foods included lots of grilling, making blini, pumpkin puree, roasted pumpkin seeds, and a good bit of custard.
</p>
</div>
</div>

<div id="outline-container-orgc16b7e2" class="outline-3">
<h3 id="orgc16b7e2">Thriftober</h3>
<div class="outline-text-3" id="text-orgc16b7e2">
<p>
<span class="underline">Score: $5 out of max of $31, 100%!</span>
</p>

<p>
I bought a few books at a book sale early on in the month but that was it! No other "unnecessary spending".
</p>
</div>
</div>

<div id="outline-container-org24328a0" class="outline-3">
<h3 id="org24328a0">Churchtober</h3>
<div class="outline-text-3" id="text-org24328a0">
<p>
<span class="underline">Score: 13/15, 87%</span>
</p>

<p>
I had to miss two services due to other family events, however, I managed to make it to every other service! This was a great way to spend some time this month.
</p>
</div>
</div>

<div id="outline-container-orgaeae77a" class="outline-3">
<h3 id="orgaeae77a">Whittletober</h3>
<div class="outline-text-3" id="text-orgaeae77a">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I ended up whittling a chess piece each day. This was a great way to stay motivated and avoid the "what will I whittle next?" question. So at this point I have 31 rough chess pieces. I plan on whittling the final king later this week.
</p>

<p>
Of course, these pieces are all rough and in need of sanding and finishing.
</p>
</div>
</div>

<div id="outline-container-orgc976cbf" class="outline-3">
<h3 id="orgc976cbf">Optober</h3>
<div class="outline-text-3" id="text-orgc976cbf">
<p>
<span class="underline">Score: ???</span>
</p>

<p>
I think I'm throwing this challenge out. It's just too hard to call for me and too fuzzy. I feel like I did pretty good at it. However, I also feel like I totally failed it. As always, man is the worst just of himself.
</p>
</div>
</div>

<div id="outline-container-org053c25b" class="outline-3">
<h3 id="org053c25b">Brotober</h3>
<div class="outline-text-3" id="text-org053c25b">
<p>
<span class="underline">Score: 22/31, 72%</span>
</p>

<p>
Due to some unforeseen circumstances, I was not able to hang out with my brother every day this month. It was still great time spent when we did hang out.
</p>
</div>
</div>

<div id="outline-container-orgc9ec295" class="outline-3">
<h3 id="orgc9ec295">Gametober</h3>
<div class="outline-text-3" id="text-orgc9ec295">
<p>
<span class="underline">Score: 31/31, 100%</span>
</p>

<p>
This was a ton of fun. The games I played were
</p>
<ul class="org-ul">
<li>Chess</li>
<li>Foosball</li>
<li>Pentago</li>
<li>Rummikub</li>
<li>40K mission 1</li>
<li>Zombie Dice</li>
<li>Go fish</li>
<li>Jenga</li>
<li>Solitaire</li>
<li>Pandemic: The Cure</li>
<li>Carcassone</li>
<li>Pandemic</li>
<li>40K mission 2</li>
<li>Connect 4</li>
<li>Carcassone w/ River Exp.</li>
<li>Blokus</li>
<li>Oregon Trail The Card Game</li>
<li>Ship-Captain-Crew</li>
<li>Midnight</li>
<li>Blokus Duo</li>
<li>Dominion: Huge Collections</li>
<li>Dominion: Forest Scouts</li>
<li>Word Yahtzee</li>
<li>Billards</li>
<li>I Can Do That!</li>
<li>What The Fish</li>
<li>Carcassone w/ Abbott Exp.</li>
<li>Magic The Gathering</li>
<li>Sudoku</li>
<li>Dominion: Decisions, Decisions</li>
<li>40K mission 3</li>
</ul>
</div>
</div>
