posts/october-goal-conclusion.org
** Drive Test Tober 

_Score: ???_

I helped my brother study a good bit but time will tell if this was successful.
   
** Navy Shower Tober
   
_Score: 31/31, 100%!_

Taking cold showers all month was brutal. It's getting colder outside which means that (1) our water's getting colder and (2) it's colder inside our house. I definitely didn't take a shower every day but, when I did, it was freezing cold. I will probably continue this challenge in warmer months in the future.
   
** Dishtober 
   
_Score: 40/41, 90%_

I did the dishes at least once a day. A family member did them once when I wasn't around, thus the miss.

** Caff-free Tober

_Score: 31/31, 100%!_

I avoided caffeine for the whole month! Well, I mean, I did eat some chocolate which supposedly has trace amounts of caffeine. The point is though that I didn't consume any beverages which have caffeine. I even avoided decaf drinks since they have some caffeine that wasn't removed.

** Rectober
   
_Score: 36/31, 116%!_

This challenge was very easy. To be frank, I tended to put an album on when I did something else. So I certainly wasn't 100% engaged with 100% of 100% of the albums. However, I did "listen to them".

Here's what I heard

 - Rush - 2112
 - Liszt - co. 1&2
 - iamthemorning - Lighthouse
 - BTBAM - Coma Ecliptic
 - BTBAM - The Great Misdirect
 - Demon Hunter - Extremist
 - John Denver - Back Home Again
 - BTBAM - Automata I
 - John Mayer - Born and Raised
 - The White Stripes - Get Behind Me Satan
 - Regina Spektor - Remember Us To Life
 - King Gizzard and the Lizard Wizard - Polygondwanaland
 - Regina Spektor - Far
 - mewithoutyou - Catch For Us The Foxes
 - Regina Spektor - Begin To Hope
 - John Mayer - Room For Squares
 - mewithoutyou - It's All Crazy It's All False It's All A Dream
 - BTBAM - Parallax I
 - BTBAM - Parallax II
 - Red Hot Chili Peppers - I'm With You
 - The Flaming Lips - Yoshimi Battles The Pink Robots
 - My Chemical Romance - The Black Parade
 - The Beatles - White Album
 - Sufjan Stevens - Carrie and Lowell
 - Steven Wilson - The Raven That Refused To Sing
 - The Beach Boys - Pet Sounds
 - Arvo Parte - Fur Anna Maria
 - Mastodon - Crack The Skye
 - Oliver!
 - The Flaming Lips - The Soft Bulletin
 - Various - Thank You Mister Rogers
 - Modest Mouse - We Were Dead Before The Ship Sank
 - Weird Al - Running With Scissors
 - Rachmaninoff - Piano Concert #2
 - Weird Al - Straight Outta Lynwood

** Bonus: 7-Tober 
   
_Score: 30/31, 97%_

As a little bonus, I'm throwing in a challenge that I mostly accomplished accidentally. I ended up waking up at 7am every day (except today)!
   
* Conclusion

This proved to be quite an interesting month. I mostly enjoyed the challenges and they certainly kept me busy. Given enough free time, I'm not sure I would do another month like this again. Though I've accomplished a lot, trying to fit it all in was a bit overwhelming at times, especially on busier days.
