docs/october-goal-conclusion.html

<div id="outline-container-org947fdcf" class="outline-3">
<h3 id="org947fdcf">Drive Test Tober</h3>
<div class="outline-text-3" id="text-org947fdcf">
<p>
<span class="underline">Score: ???</span>
</p>

<p>
I helped my brother study a good bit but time will tell if this was successful.
</p>
</div>
</div>

<div id="outline-container-org422b26b" class="outline-3">
<h3 id="org422b26b">Navy Shower Tober</h3>
<div class="outline-text-3" id="text-org422b26b">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
Taking cold showers all month was brutal. It's getting colder outside which means that (1) our water's getting colder and (2) it's colder inside our house. I definitely didn't take a shower every day but, when I did, it was freezing cold. I will probably continue this challenge in warmer months in the future.
</p>
</div>
</div>

<div id="outline-container-org894cc88" class="outline-3">
<h3 id="org894cc88">Dishtober</h3>
<div class="outline-text-3" id="text-org894cc88">
<p>
<span class="underline">Score: 40/41, 90%</span>
</p>

<p>
I did the dishes at least once a day. A family member did them once when I wasn't around, thus the miss.
</p>
</div>
</div>

<div id="outline-container-orgb02a6ca" class="outline-3">
<h3 id="orgb02a6ca">Caff-free Tober</h3>
<div class="outline-text-3" id="text-orgb02a6ca">
<p>
<span class="underline">Score: 31/31, 100%!</span>
</p>

<p>
I avoided caffeine for the whole month! Well, I mean, I did eat some chocolate which supposedly has trace amounts of caffeine. The point is though that I didn't consume any beverages which have caffeine. I even avoided decaf drinks since they have some caffeine that wasn't removed.
</p>
</div>
</div>

<div id="outline-container-orgc00c026" class="outline-3">
<h3 id="orgc00c026">Rectober</h3>
<div class="outline-text-3" id="text-orgc00c026">
<p>
<span class="underline">Score: 36/31, 116%!</span>
</p>

<p>
This challenge was very easy. To be frank, I tended to put an album on when I did something else. So I certainly wasn't 100% engaged with 100% of 100% of the albums. However, I did "listen to them".
</p>

<p>
Here's what I heard
</p>

<ul class="org-ul">
<li>Rush - 2112</li>
<li>Liszt - co. 1&amp;2</li>
<li>iamthemorning - Lighthouse</li>
<li>BTBAM - Coma Ecliptic</li>
<li>BTBAM - The Great Misdirect</li>
<li>Demon Hunter - Extremist</li>
<li>John Denver - Back Home Again</li>
<li>BTBAM - Automata I</li>
<li>John Mayer - Born and Raised</li>
<li>The White Stripes - Get Behind Me Satan</li>
<li>Regina Spektor - Remember Us To Life</li>
<li>King Gizzard and the Lizard Wizard - Polygondwanaland</li>
<li>Regina Spektor - Far</li>
<li>mewithoutyou - Catch For Us The Foxes</li>
<li>Regina Spektor - Begin To Hope</li>
<li>John Mayer - Room For Squares</li>
<li>mewithoutyou - It's All Crazy It's All False It's All A Dream</li>
<li>BTBAM - Parallax I</li>
<li>BTBAM - Parallax II</li>
<li>Red Hot Chili Peppers - I'm With You</li>
<li>The Flaming Lips - Yoshimi Battles The Pink Robots</li>
<li>My Chemical Romance - The Black Parade</li>
<li>The Beatles - White Album</li>
<li>Sufjan Stevens - Carrie and Lowell</li>
<li>Steven Wilson - The Raven That Refused To Sing</li>
<li>The Beach Boys - Pet Sounds</li>
<li>Arvo Parte - Fur Anna Maria</li>
<li>Mastodon - Crack The Skye</li>
<li>Oliver!</li>
<li>The Flaming Lips - The Soft Bulletin</li>
<li>Various - Thank You Mister Rogers</li>
<li>Modest Mouse - We Were Dead Before The Ship Sank</li>
<li>Weird Al - Running With Scissors</li>
<li>Rachmaninoff - Piano Concert #2</li>
<li>Weird Al - Straight Outta Lynwood</li>
</ul>
</div>
</div>

<div id="outline-container-org855ea74" class="outline-3">
<h3 id="org855ea74">Bonus: 7-Tober</h3>
<div class="outline-text-3" id="text-org855ea74">
<p>
<span class="underline">Score: 30/31, 97%</span>
</p>

<p>
As a little bonus, I'm throwing in a challenge that I mostly accomplished accidentally. I ended up waking up at 7am every day (except today)!
</p>
</div>
</div>
</div>

<div id="outline-container-org14f6aa9" class="outline-2">
<h2 id="org14f6aa9">Conclusion</h2>
<div class="outline-text-2" id="text-org14f6aa9">
<p>
This proved to be quite an interesting month. I mostly enjoyed the challenges and they certainly kept me busy. Given enough free time, I'm not sure I would do another month like this again. Though I've accomplished a lot, trying to fit it all in was a bit overwhelming at times, especially on busier days.
</p>
</div>
</div>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-reading.html">reading</a> <a href="https://mjgpy3.github.io/me/tag-books.html">books</a> <a href="https://mjgpy3.github.io/me/tag-skateboarding.html">skateboarding</a> <a href="https://mjgpy3.github.io/me/tag-writing.html">writing</a> <a href="https://mjgpy3.github.io/me/tag-orthodox.html">orthodox</a> <a href="https://mjgpy3.github.io/me/tag-art.html">art</a> <a href="https://mjgpy3.github.io/me/tag-music.html">music</a> <a href="https://mjgpy3.github.io/me/tag-exercise.html">exercise</a> <a href="https://mjgpy3.github.io/me/tag-gaming.html">gaming</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
